app/Controllers/frontend/RegistrationController.php

INSERT INTO `users` (`name`, `email`, `password`) VALUES (NULL, NULL, '$2y$10$AhifgsdV6nm5ovisJmJCiu.HkCgrAIZNpwFc9BGbdSqSjQdSeVLWO')
---
    public function registration()
    {
        $userModel = new UserModel();
        $data = [
            'fname' => $this->request->getVar('fname'),
            'email' => $this->request->getVar('email'),
            'password' => password_hash($this->request->getVar('password'),PASSWORD_DEFAULT),
        ];
        // print_r($inputs);

        if($userModel->insert($data)){