app/Controllers/CategoryController.php

SELECT *
FROM `category`
---
    public function index()
    {
        $category = new CategoryModel();
        $data['items'] = $category->findAll();