app/Controllers/ProductController.php

    public function index()
    {
        $this->products->join('category', 'category.id = products.category_id'); // for category table
        $data['items'] = $this->products->findAll();
---
SELECT *
FROM `products`
JOIN `category` ON `category`.`id` = `products`.`category_id`

    public function create(){
        $data['cats'] = $this->category->findAll(); // to catch category value here
---
SELECT *
FROM `category`