app/Controllers/SigninController.php

    public function login(){
        // echo "<h1 style='color:blue'>you are here</h1>";  // just for checking to get path or not??

        // step: 02 to show login data
        $session = session();
        $userModel = new UserModel();
        $email = $this->request->getVar('email');
        $formpass = $this->request->getVar('password');

        // $formpassword = password_hash($password, PASSWORD_DEFAULT);
        // echo 'Formpassword:' .$formpassword =

        $data = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'ikbalhossain125@gmail.com'
 LIMIT 1